In [4]:
import pandas as pd

In [5]:
data = pd.read_csv('/home/youx/youxlab-treino-git/curso_dados/venda-de-carros.csv')
data

  Fabricante       Cor  Quilometragem  Portas          Preco
0     Toyota    Branco         150043       4   R$ 24,000.00
1      Honda  Vermelho          87899       4   R$ 25,000.00
2     Toyota      Azul          32549       3   R$ 27,000.00
3        BMW     Preto          11179       5  R$ 122,000.00
4     Nissan    Branco         213095       4   R$ 13,500.00
5     Toyota     Verde          99213       4   R$ 14,500.00
6      Honda      Azul          45698       4   R$ 17,500.00
7      Honda      Azul          54738       4   R$ 27,000.00
8     Toyota    Branco          60000       4   R$ 26,250.00
9     Nissan    Branco          31600       4   R$ 19,700.00

In [6]:
data.head()

  Fabricante       Cor  Quilometragem  Portas          Preco
0     Toyota    Branco         150043       4   R$ 24,000.00
1      Honda  Vermelho          87899       4   R$ 25,000.00
2     Toyota      Azul          32549       3   R$ 27,000.00
3        BMW     Preto          11179       5  R$ 122,000.00
4     Nissan    Branco         213095       4   R$ 13,500.00

In [7]:
data.head(6)

  Fabricante       Cor  Quilometragem  Portas          Preco
0     Toyota    Branco         150043       4   R$ 24,000.00
1      Honda  Vermelho          87899       4   R$ 25,000.00
2     Toyota      Azul          32549       3   R$ 27,000.00
3        BMW     Preto          11179       5  R$ 122,000.00
4     Nissan    Branco         213095       4   R$ 13,500.00
5     Toyota     Verde          99213       4   R$ 14,500.00

In [8]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Fabricante     10 non-null     object
 1   Cor            10 non-null     object
 2   Quilometragem  10 non-null     int64
 3   Portas         10 non-null     int64
 4   Preco          10 non-null     object
dtypes: int64(2), object(3)
memory usage: 528.0+ bytes

In [9]:
type(data)

pandas.core.frame.DataFrame

In [10]:
data.shape

(10, 5)

In [13]:
personagens_df= pd.DataFrame({
    'nome':['luke''skywalker', 'yoda','palpatine'],
    'idade:':[16, 1000,70],
    'peso':[70.5, 15.2, 60.11 ],
    'el jedi':[True, True, False]
})

In [14]:
personagens_df.columns

Index(['nome', 'idade:', 'peso', 'el jedi'], dtype='object')

In [15]:
lista_personagens= list(personagens_df.columns)
lista_personagens

['nome', 'idade:', 'peso', 'el jedi']

In [21]:
personagens_df_renomeado = personagens_df.rename(columns={
    'nome': 'Nome completo',
    'idade': 'Idade'
})

personagens_df_renomeado

   Nome completo  idade:   peso  el jedi
0  lukeskywalker      16  70.50     True
1           yoda    1000  15.20     True
2      palpatine      70  60.11    False

In [22]:
personagens_df.rename(columns={
    'nome':'Nome completo',
    'idade':'Idade'},
    inplace=True)
personagens_df

   Nome completo  idade:   peso  el jedi
0  lukeskywalker      16  70.50     True
1           yoda    1000  15.20     True
2      palpatine      70  60.11    False

In [23]:
personagens_df.columns=['NOME','IDADE','PESO', 'EH_JEDI']
personagens_df

            NOME  IDADE   PESO  EH_JEDI
0  lukeskywalker     16  70.50     True
1           yoda   1000  15.20     True
2      palpatine     70  60.11    False

In [ ]:
print(data['Fabricante'])
type(data['Fabricante'])

0    Toyota
1     Honda
2    Toyota
3       BMW
4    Nissan
5    Toyota
6     Honda
7     Honda
8    Toyota
9    Nissan
Name: Fabricante, dtype: object

pandas.core.series.Series

In [25]:
series1=pd.Series([5.5, 6.0, 9.5])
series1

0    5.5
1    6.0
2    9.5
dtype: float64

In [26]:
series1=pd.Series([5.5, 6.0,9.5], index=['prova 1',' prova 2', 'projeto'], name='Notas dos luke skywalker')
series1

prova 1     5.5
 prova 2    6.0
projeto     9.5
Name: Notas dos luke skywalker, dtype: float64

In [29]:
cor_copia =data['Cor'].copy
cor_copia

<bound method NDFrame.copy of 0      Branco
1    Vermelho
2        Azul
3       Preto
4      Branco
5       Verde
6        Azul
7        Azul
8      Branco
9      Branco
Name: Cor, dtype: object>

In [31]:
series1=pd.Series([5.5, 6.0,9.5], index=['prova 1',' prova 2', 'projeto'], name='Notas dos luke skywalker')
series2=pd.Series([8.2, 6.5, 12.5], index=['prova 1',' prova 2', 'projeto'], name='Notas dos Lakers')
data_series=pd.concat([series1, series2],axis=1)

In [32]:
data['Nova coluna']= 'Testando'
data

  Fabricante       Cor  Quilometragem  Portas          Preco Nova coluna
0     Toyota    Branco         150043       4   R$ 24,000.00    Testando
1      Honda  Vermelho          87899       4   R$ 25,000.00    Testando
2     Toyota      Azul          32549       3   R$ 27,000.00    Testando
3        BMW     Preto          11179       5  R$ 122,000.00    Testando
4     Nissan    Branco         213095       4   R$ 13,500.00    Testando
5     Toyota     Verde          99213       4   R$ 14,500.00    Testando
6      Honda      Azul          45698       4   R$ 17,500.00    Testando
7      Honda      Azul          54738       4   R$ 27,000.00    Testando
8     Toyota    Branco          60000       4   R$ 26,250.00    Testando
9     Nissan    Branco          31600       4   R$ 19,700.00    Testando

In [33]:
data['Quilometragem']=data['Quilometragem'] *2
data

  Fabricante       Cor  Quilometragem  Portas          Preco Nova coluna
0     Toyota    Branco         300086       4   R$ 24,000.00    Testando
1      Honda  Vermelho         175798       4   R$ 25,000.00    Testando
2     Toyota      Azul          65098       3   R$ 27,000.00    Testando
3        BMW     Preto          22358       5  R$ 122,000.00    Testando
4     Nissan    Branco         426190       4   R$ 13,500.00    Testando
5     Toyota     Verde         198426       4   R$ 14,500.00    Testando
6      Honda      Azul          91396       4   R$ 17,500.00    Testando
7      Honda      Azul         109476       4   R$ 27,000.00    Testando
8     Toyota    Branco         120000       4   R$ 26,250.00    Testando
9     Nissan    Branco          63200       4   R$ 19,700.00    Testando

In [34]:
print(data)
data.iloc[2]

  Fabricante       Cor  Quilometragem  Portas          Preco Nova coluna
0     Toyota    Branco         300086       4   R$ 24,000.00    Testando
1      Honda  Vermelho         175798       4   R$ 25,000.00    Testando
2     Toyota      Azul          65098       3   R$ 27,000.00    Testando
3        BMW     Preto          22358       5  R$ 122,000.00    Testando
4     Nissan    Branco         426190       4   R$ 13,500.00    Testando
5     Toyota     Verde         198426       4   R$ 14,500.00    Testando
6      Honda      Azul          91396       4   R$ 17,500.00    Testando
7      Honda      Azul         109476       4   R$ 27,000.00    Testando
8     Toyota    Branco         120000       4   R$ 26,250.00    Testando
9     Nissan    Branco          63200       4   R$ 19,700.00    Testando

Fabricante             Toyota
Cor                      Azul
Quilometragem           65098
Portas                      3
Preco            R$ 27,000.00
Nova coluna          Testando
Name: 2, dtype: object

In [35]:
print(data)
data.iloc[4:6]

  Fabricante       Cor  Quilometragem  Portas          Preco Nova coluna
0     Toyota    Branco         300086       4   R$ 24,000.00    Testando
1      Honda  Vermelho         175798       4   R$ 25,000.00    Testando
2     Toyota      Azul          65098       3   R$ 27,000.00    Testando
3        BMW     Preto          22358       5  R$ 122,000.00    Testando
4     Nissan    Branco         426190       4   R$ 13,500.00    Testando
5     Toyota     Verde         198426       4   R$ 14,500.00    Testando
6      Honda      Azul          91396       4   R$ 17,500.00    Testando
7      Honda      Azul         109476       4   R$ 27,000.00    Testando
8     Toyota    Branco         120000       4   R$ 26,250.00    Testando
9     Nissan    Branco          63200       4   R$ 19,700.00    Testando

  Fabricante     Cor  Quilometragem  Portas         Preco Nova coluna
4     Nissan  Branco         426190       4  R$ 13,500.00    Testando
5     Toyota   Verde         198426       4  R$ 14,500.00    Testando

In [38]:
print(data)
data.iloc[4:6, 2]

  Fabricante       Cor  Quilometragem  Portas          Preco Nova coluna
0     Toyota    Branco         300086       4   R$ 24,000.00    Testando
1      Honda  Vermelho         175798       4   R$ 25,000.00    Testando
2     Toyota      Azul          65098       3   R$ 27,000.00    Testando
3        BMW     Preto          22358       5  R$ 122,000.00    Testando
4     Nissan    Branco         426190       4   R$ 13,500.00    Testando
5     Toyota     Verde         198426       4   R$ 14,500.00    Testando
6      Honda      Azul          91396       4   R$ 17,500.00    Testando
7      Honda      Azul         109476       4   R$ 27,000.00    Testando
8     Toyota    Branco         120000       4   R$ 26,250.00    Testando
9     Nissan    Branco          63200       4   R$ 19,700.00    Testando

4    426190
5    198426
Name: Quilometragem, dtype: int64

In [39]:
print(data)
data.loc[4]

  Fabricante       Cor  Quilometragem  Portas          Preco Nova coluna
0     Toyota    Branco         300086       4   R$ 24,000.00    Testando
1      Honda  Vermelho         175798       4   R$ 25,000.00    Testando
2     Toyota      Azul          65098       3   R$ 27,000.00    Testando
3        BMW     Preto          22358       5  R$ 122,000.00    Testando
4     Nissan    Branco         426190       4   R$ 13,500.00    Testando
5     Toyota     Verde         198426       4   R$ 14,500.00    Testando
6      Honda      Azul          91396       4   R$ 17,500.00    Testando
7      Honda      Azul         109476       4   R$ 27,000.00    Testando
8     Toyota    Branco         120000       4   R$ 26,250.00    Testando
9     Nissan    Branco          63200       4   R$ 19,700.00    Testando

Fabricante             Nissan
Cor                    Branco
Quilometragem          426190
Portas                      4
Preco            R$ 13,500.00
Nova coluna          Testando
Name: 4, dtype: object

In [40]:
print(data)
data.loc[4:6]

  Fabricante       Cor  Quilometragem  Portas          Preco Nova coluna
0     Toyota    Branco         300086       4   R$ 24,000.00    Testando
1      Honda  Vermelho         175798       4   R$ 25,000.00    Testando
2     Toyota      Azul          65098       3   R$ 27,000.00    Testando
3        BMW     Preto          22358       5  R$ 122,000.00    Testando
4     Nissan    Branco         426190       4   R$ 13,500.00    Testando
5     Toyota     Verde         198426       4   R$ 14,500.00    Testando
6      Honda      Azul          91396       4   R$ 17,500.00    Testando
7      Honda      Azul         109476       4   R$ 27,000.00    Testando
8     Toyota    Branco         120000       4   R$ 26,250.00    Testando
9     Nissan    Branco          63200       4   R$ 19,700.00    Testando

  Fabricante     Cor  Quilometragem  Portas         Preco Nova coluna
4     Nissan  Branco         426190       4  R$ 13,500.00    Testando
5     Toyota   Verde         198426       4  R$ 14,500.00    Testando
6      Honda    Azul          91396       4  R$ 17,500.00    Testando

In [41]:
print(data)
data.loc[4:6, 'Quilometragem']

  Fabricante       Cor  Quilometragem  Portas          Preco Nova coluna
0     Toyota    Branco         300086       4   R$ 24,000.00    Testando
1      Honda  Vermelho         175798       4   R$ 25,000.00    Testando
2     Toyota      Azul          65098       3   R$ 27,000.00    Testando
3        BMW     Preto          22358       5  R$ 122,000.00    Testando
4     Nissan    Branco         426190       4   R$ 13,500.00    Testando
5     Toyota     Verde         198426       4   R$ 14,500.00    Testando
6      Honda      Azul          91396       4   R$ 17,500.00    Testando
7      Honda      Azul         109476       4   R$ 27,000.00    Testando
8     Toyota    Branco         120000       4   R$ 26,250.00    Testando
9     Nissan    Branco          63200       4   R$ 19,700.00    Testando

4    426190
5    198426
6     91396
Name: Quilometragem, dtype: int64

In [43]:
data[['Fabricante','Cor','Portas']]

  Fabricante       Cor  Portas
0     Toyota    Branco       4
1      Honda  Vermelho       4
2     Toyota      Azul       3
3        BMW     Preto       5
4     Nissan    Branco       4
5     Toyota     Verde       4
6      Honda      Azul       4
7      Honda      Azul       4
8     Toyota    Branco       4
9     Nissan    Branco       4

In [44]:
del data['Quilometragem']
data

  Fabricante       Cor  Portas          Preco Nova coluna
0     Toyota    Branco       4   R$ 24,000.00    Testando
1      Honda  Vermelho       4   R$ 25,000.00    Testando
2     Toyota      Azul       3   R$ 27,000.00    Testando
3        BMW     Preto       5  R$ 122,000.00    Testando
4     Nissan    Branco       4   R$ 13,500.00    Testando
5     Toyota     Verde       4   R$ 14,500.00    Testando
6      Honda      Azul       4   R$ 17,500.00    Testando
7      Honda      Azul       4   R$ 27,000.00    Testando
8     Toyota    Branco       4   R$ 26,250.00    Testando
9     Nissan    Branco       4   R$ 19,700.00    Testando

In [45]:
data['Fabricante'].unique()

array(['Toyota', 'Honda', 'BMW', 'Nissan'], dtype=object)

In [48]:
data_filtrados= data.query('Fabricante == "Honda"').reset_index()
data_filtrados

   index Fabricante       Cor  Portas         Preco Nova coluna
0      1      Honda  Vermelho       4  R$ 25,000.00    Testando
1      6      Honda      Azul       4  R$ 17,500.00    Testando
2      7      Honda      Azul       4  R$ 27,000.00    Testando

In [51]:
data_filtrados2= data.query('Fabricante== "Honda" and Cor == "Azul"').reset_index()
data_filtrados2

   index Fabricante   Cor  Portas         Preco Nova coluna
0      6      Honda  Azul       4  R$ 17,500.00    Testando
1      7      Honda  Azul       4  R$ 27,000.00    Testando

In [1]:
lista_cor=['Azul','Vermelho']
data_filtrados2= data.query()
data_filtrados2

NameError: name 'data' is not defined

In [66]:
data[ 'Quilometragem'].describe()

KeyError: 'Quilometragem'